RhinoInside.Revit API Documentation
GeometryEncoder.ToBoundingBoxXYZ Method (Box)
 Converts the specified Rhino.Geometry.Box to an equivalent Autodesk.Revit.DB.BoundingBoxXYZ.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.BoundingBoxXYZ ToBoundingBoxXYZ(
	this Rhino.Geometry.Box box
)
@staticmethod
def ToBoundingBoxXYZ(
	box: Rhino.Geometry.Box
) -> Autodesk.Revit.DB.BoundingBoxXYZ
Parameters
box
Type: Rhino.Geometry.Box
Rhino box to convert.
Return Value
Type: Autodesk.Revit.DB.BoundingBoxXYZ
Revit bounding box that is equivalent to the provided Rhino box.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Box. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToBoundingBoxXYZ(Box) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.BoundingBoxXYZ revitBBox = rhinoBox.ToBoundingBoxXYZ();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_bbox = rhino_box.ToBoundingBoxXYZ()    # type: DB.BoundingBoxXYZ
 Using ToBoundingBoxXYZ(Box) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.BoundingBoxXYZ revitBBox = GeometryEncoder.ToBoundingBoxXYZ(rhinoBox);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_bbox = GE.ToBoundingBoxXYZ(rhino_box)    # type: DB.BoundingBoxXYZ
See Also
Reference
GeometryEncoder Class
ToBoundingBoxXYZ Overload
RhinoInside.Revit.Convert.Geometry Namespace